views/nhatro/_form.php

                        <div class="row p-3">
                            <div class="col-12">
                                <p class="text-bold">Chọn khu vực</p>
                                <?= $form->field($model, 'dmkhuvuc_id')->dropDownList(
                                    ArrayHelper::map(Dmkhuvuc::find()->all(), 'id', 'khuvuc')
                                )->label(false)?>
---
SELECT * FROM "dmkhuvuc"