views/nhatro/duyet.php

            'mota',
            'lienhe',
            'gia',
            [
                'attribute' => 'dmkhuvuc_id',
                'value' => function($model) {
                    $listDmKhuvuc = app\models\Dmkhuvuc::find()->where(['id' => $model->dmkhuvuc_id])->all();
                    foreach ($listDmKhuvuc as $dmKhuvuc) {
                        return $dmKhuvuc->khuvuc;
                    }
                },
            ],
---
SELECT * FROM "dmkhuvuc" WHERE "id"='3'
SELECT * FROM "dmkhuvuc" WHERE "id"='17'

                    ]);
                }
            ],
            [
                'label' => 'Tiện ích',
                'attribute' => 'dmtienich_id',
                'value' => function($model) {
                    $listDmTienich = VNhatroDmtienich::find()->where(['nhatro_id' => $model->id])->all();
                    $result = "";
                    foreach ($listDmTienich as $dmTienich) {
                        $result .= '- ' .$dmTienich->tienich .' ';
                    }
                    return $result;
                }
            ],
            [
                'label' => 'Đối tượng',
                'attribute' => 'dmdoituong_id',
                'value' => function($model) {
                    $listDmDoituong = VNhatroDmdoituong::find()->where(['nhatro_id' => $model->id])->all();
                    $result = "";
                    foreach ($listDmDoituong as $dmDoituong) {
                        $result .= '- ' .$dmDoituong->ten .' ';
                    }
                    return $result;
                }
            ],
---
SELECT * FROM "v_nhatro_dmtienich" WHERE "nhatro_id"=9
SELECT * FROM "v_nhatro_dmdoituong" WHERE "nhatro_id"=9