views/nhatro/index.php

SELECT * FROM "user" WHERE "id" IS NULL
---
                'label' => 'Tài khoản',
                'attribute' => 'user_id',
                'value' => function($model) {
                    $listUser = app\models\User::find()->where(['id' => $model->user_id])->all();

SELECT * FROM "dmkhuvuc" WHERE "id"='1'
SELECT * FROM "dmkhuvuc" WHERE "id"=18
SELECT * FROM "v_nhatro_dmdoituong" WHERE "nhatro_id"=103
SELECT * FROM "v_nhatro_dmdoituong" WHERE "nhatro_id"=1
SELECT * FROM "v_nhatro_dmtienich" WHERE "nhatro_id"=11
SELECT * FROM "v_nhatro_dmtienich" WHERE "nhatro_id"=1
---
                    }
                }
            ],
            [
                'label' => 'Khu vực',
                'attribute' => 'dmkhuvuc_id',
                'value' => function($model) {
                    $listDmKhuvuc = app\models\Dmkhuvuc::find()->where(['id' => $model->dmkhuvuc_id])->all();
                    foreach ($listDmKhuvuc as $dmKhuvuc) {
                        return $dmKhuvuc->khuvuc;
                    }
                }
            ],
            'gia',
            [
                'label' => 'Đối tượng',
                'attribute' => 'dmdoituong_id',
                'content' => function($model) {
                    $listDmDoituong = VNhatroDmdoituong::find()->where(['nhatro_id' => $model->id])->all();
                    $result = "";
                    foreach ($listDmDoituong as $dmDoituong) {
                        $result .= '- '. $dmDoituong->ten . '</br>';
                    }
                    return Html::tag('span', $result, []);
                },
            ],
            [
                'label' => 'Tiện ích',
                'attribute' => 'dmtienich_id',
                'content' => function($model) {
                    $listDmTienich = VNhatroDmtienich::find()->where(['nhatro_id' => $model->id])->all();
                    $result = "";
                    foreach ($listDmTienich as $dmTienich) {
                        $result .= '- ' .$dmTienich->tienich .'</br>';
                    }
                    return Html::tag('span', $result, []);
                }
            ],