controllers/HomeController.php

    public function actionIndex()
    {
        $listNewPost = Nhatro::find()->where('status=1')->orderBy([
            'updated_at' => SORT_DESC,
        ])->all();
        $homeSearchForm = new HomeSearchForm();
        $filterBoxForm = new FilterBoxForm();
        $queryNhatro = Nhatro::find()->where('status=1');
        $listDmgia = Dmgia::find()->all();
        $listDmtienich = Dmtienich::find()->all();
---
SELECT * FROM "dmtienich"