controllers/HomeController.php

SELECT * FROM "nhatro"
SELECT * FROM "dmgia"
SELECT * FROM "dmkhuvuc"
SELECT * FROM "dmdientich"
SELECT * FROM "nhatro" WHERE (("tieude" ILIKE '%%') OR ("gia" ILIKE '%%')) OR ("diachi" ILIKE '%%')
---
    public function actionIndex()
    {
        $dmgia = Dmgia::find()->all();
        $dmdientich = Dmdientich::find()->all();
        $tienich = Tienich::find()->all();

        $listNewPost = Nhatro::find()->all();
        $homeSearchForm = new HomeSearchForm();
        $filterBoxForm = new FilterBoxForm();
        $queryNhatro = Nhatro::find();
        $listDmgia = Dmgia::find()->all();
        $listTienich = Tienich::find()->all();
        $listDmkhuvuc = Dmkhuvuc::find()->all();
        $listDmdientich = Dmdientich::find()->all();
        $homeSearchForm->load(Yii::$app->request->get());
        if (isset($homeSearchForm->query)) {
            $queryNhatro->orWhere(['ilike', 'tieude', $homeSearchForm->query])->orWhere(['ilike', 'gia', $homeSearchForm->query])->orWhere(['ilike', 'diachi', $homeSearchForm->query]);
        }
        $listNhatro = $queryNhatro->all();