controllers/NhatroController.php

        public function actionGetlistjson() {
            // json, ajax, vuejs
            $data = Yii::$app->request;
            $query = Nhatro::find()->where('1=1');
            // $dmTienich = Dmtienich::find();

            $q = $data->get('q');
            if (isset($q) && !empty($q)) {
                $query->andWhere(['ilike', 'tieude', $q]);
            }


            $listKhuvucId = $data->get('listKhuvucId');
            if ($listKhuvucId && is_array($listKhuvucId)) {
                $query->andWhere(['in','dmkhuvuc_id', $listKhuvucId]);
            }

            $listDoituongId = $data->get('listDoituongId');
            if ($listDoituongId && is_array($listDoituongId)) {
                $listNhatroIdHaveDoituong = NhatroDmdoituong::find()->where(['in', 'doituong_id', $listDoituongId])->select('nhatro_id')->column();
                $query->andWhere(['in', 'id', $listNhatroIdHaveDoituong]);
            }

            $listTienichId = $data->get('listTienichId');
            if ($listTienichId && is_array($listTienichId)) {
                $listNhatroIdHaveTienich = NhatroDmtienich::find()->where(['in', 'tienich_id', $listTienichId])->select('nhatro_id')->column();
---
SELECT * FROM "nhatro" WHERE (1=1) AND ("id" IN (169, 200))
SELECT "id" FROM "nhatro_dmtienich" WHERE "tienich_id" IN ('14', '11')

        public function actionGetdetailjson($id) {
            // $data = Yii::$app->request;
            // $q = Diemthuongmai::find()->where('1=1')->select('geom');
            $nhatro = Nhatro::find()->where(['id' => $id])->asArray()->one();
---
SELECT * FROM "nhatro" WHERE "id"='12'

        public function actionIndex()
        {
            $searchModel = new NhatroSearch();
            // $query = Nhatro::find()->where(['user_id'=> Yii::$app->user->id]);
            $query = Nhatro::find();
---
SELECT * FROM "nhatro" WHERE "id"='9'