controllers/NhatroController.php

SELECT "tieude", "id", "lat", "lng" FROM "nhatro" WHERE (1=1) AND ("tieude" ILIKE '%trung%')
---
    public function actionGetlistjson() {
        // json, ajax, vuejs
        $q = Yii::$app->request->get('q');

        $query = Nhatro::find()->where('1=1');
        if (isset($q) && !empty($q)) {
            $query->andWhere(['ilike', 'tieude', $q]);
        }

        $listNhatro = $query->select(['tieude', 'id', 'lat', 'lng', 'lienhe'])->asArray()->all();

SELECT * FROM "nhatro" WHERE "id"='4'
---
    public function actionGetdetailjson($id) {
        $nhatro = Nhatro::find()->where(['id' => $id])->asArray()->one();

SELECT * FROM "dmkhuvuc"
SELECT * FROM "dmdoituong"
SELECT * FROM "dmtienich"
---
    public function actionCreate()
    {
        $model = new Nhatro();
        if($model->load(Yii::$app->request->post())) {
            if($model->save()) {
               // Save doituong
                $listDmDoituongId = Yii::$app->request->post('list_dmdoituong_id');
                foreach ($listDmDoituongId as $dmDoituongId) {
                    $nhatroDmDoituong = new NhatroDmdoituong();
                    $nhatroDmDoituong->nhatro_id = $model->id;
                    $nhatroDmDoituong->doituong_id = $dmDoituongId;
                    $nhatroDmDoituong->save();
                }
                $listDmTienichId = Yii::$app->request->post('list_dmtienich_id');
                foreach ($listDmTienichId as $dmTienichId) {
                    $nhatroDmTienich = new NhatroDmtienich();
                    $nhatroDmTienich->nhatro_id = $model->id;
                    $nhatroDmTienich->tienich_id = $dmTienichId;
                    $nhatroDmTienich->save();
                }

                Yii::$app->session->addFlash('success', 'Đã đăng !');
                return $this->redirect(['view', 'id' => $model->id]);
            }
            else {
                Yii::$app->session->addFlash('danger', 'Không hợp lệ !');
                return $this->render('create', ['model' => $model,]);
            }
        }
        $listDmKhuvuc = Dmkhuvuc::find()->all();
        $listDmDoituong = Dmdoituong::find()->all();
        $listDmTienich = Dmtienich::find()->all();

SELECT * FROM "nhatro_dmdoituong" WHERE "nhatro_id"='14'
SELECT * FROM "nhatro_dmtienich" WHERE "nhatro_id"='14'
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        if ($model->load(Yii::$app->request->post())) {
            if ($model->save()) {
                NhatroDmdoituong::deleteAll(['nhatro_id' => $model->id]);
                $listDmDoituongId = Yii::$app->request->post('list_dmdoituong_id');
                foreach ($listDmDoituongId as $dmDoituongId) {
                    $nhatroDmDoituong = new NhatroDmdoituong();
                    $nhatroDmDoituong->nhatro_id = $model->id;
                    $nhatroDmDoituong->doituong_id = $dmDoituongId;
                    $nhatroDmDoituong->save();
                }
                NhatroDmtienich::deleteAll(['nhatro_id' => $model->id]);
                $listDmTienichId = Yii::$app->request->post('list_dmtienich_id');
                foreach ($listDmTienichId as $dmTienichId) {
                    $nhatroDmTienich = new NhatroDmtienich();
                    $nhatroDmTienich->nhatro_id = $model->id;
                    $nhatroDmTienich->tienich_id = $dmTienichId;
                    $nhatroDmTienich->save();
                }
                return $this->redirect(['view', 'id' => $model->id]);
            }
        }
        // De tim danh sach doi tuong cua nha tro, nhatro -> nhatroDmdoituong -> doituong.
        // Tim trong bang Dmdoituong nhatro_id = $id
        // Dua danh sach len view
        // nhatro - doituong => ddddx

        $listNhatroDmDoituong = NhatroDmdoituong::find()->where(['nhatro_id' => $id])->all();
        $listNhatroDmTienich = NhatroDmtienich::find()->where(['nhatro_id' => $id])->all();

SELECT * FROM "dmkhuvuc"
SELECT * FROM "dmdoituong"
SELECT * FROM "dmtienich"
---
            array_push($listDmTienichIdOfNhatro, $nhatroDmTienich->tienich_id);
        }

        $listDmKhuvuc = Dmkhuvuc::find()->all();
        $listDmDoituong = Dmdoituong::find()->all();
        $listDmTienich = Dmtienich::find()->all();

SELECT * FROM "nhatro" WHERE "id"='14'
---
    protected function findModel($id)
    {
        if (($model = Nhatro::findOne(['id' => $id])) !== null) {